In [2]:
# pandas : numpy 기반으로 개발된 패키지 
# 1차원 배열 series 2차원 배열 Dataframe
# 강력한 데이터 연산 기능 제공 
# datafram 객체는 여러 데이터 타입을 사용할 수 있으며, 값의 누락 역시 허용

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.Series(np.linspace(0,1,num=5)) 
# series: 인덱스 가 있고, 데이터들이 들어가 있음 
data

0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

In [9]:
data.values

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [10]:
type(data.values) # series의 내부 구조는 numpy

numpy.ndarray

In [11]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
# 테이블 모양의 데이터 프레임은 행 인덱스와 행 이름으로 구성

In [13]:
data[1] # 인덱싱

0.25

In [16]:
data[2:4] # 슬라이싱

2    0.50
3    0.75
dtype: float64

In [14]:
data[(data>0.1)&(data<0.6)] # 마스킹

1    0.25
2    0.50
dtype: float64

In [17]:
data[[2,4]] # 팬시 인덱싱

2    0.5
4    1.0
dtype: float64

In [19]:
list(data.keys()) #index

[0, 1, 2, 3, 4]

In [21]:
list(data.items()) #data.items --> tuple 로 나옴

[(0, 0.0), (1, 0.25), (2, 0.5), (3, 0.75), (4, 1.0)]

In [22]:
data.index=['a','b','c','d','e'] # 숫자가 아닌 값을도 인덱스를 대신할 수 있음 (유연성)
data

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [23]:
data.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [24]:
# 원래의 인덱스 = 암묵적 인덱스, 지정해준 것 = 명시적 인덱스

In [25]:
data.loc['a'] # 인덱싱 # 명시적 인덱스에 대해 사용하는 것/ 함수가 아님 (인덱서)

0.0

In [26]:
data.loc['a':'c']# 슬라이싱

a    0.00
b    0.25
c    0.50
dtype: float64

In [27]:
data.loc[['a','c']]#팬시인덱싱

a    0.0
c    0.5
dtype: float64

In [28]:
data.loc[data>0.7]#마스킹

d    0.75
e    1.00
dtype: float64

In [4]:
data.iloc[0] # 암묵적 인덱스 인덱싱

0.0

In [5]:
data.iloc[0:3] # 슬라이싱

0    0.00
1    0.25
2    0.50
dtype: float64

In [7]:
data.iloc[[0,2]] # 팬시 인덱싱

0    0.0
2    0.5
dtype: float64

In [9]:
np.random.seed(0)

df=pd.DataFrame(np.random.randint(10,size=(3,4)),columns=['col1','col2','col3','col4'])
df # 시리즈가 여러개 연결된 게 dataframe / 다양한 타입의 데이터를 사용할 수 있음

   col1  col2  col3  col4
0     5     0     3     3
1     7     9     3     5
2     2     4     7     6

In [10]:
df['col2'] # 데이터 접근 방식 두가지

0    0
1    9
2    4
Name: col2, dtype: int32

In [12]:
df.col2

0    0
1    9
2    4
Name: col2, dtype: int32

In [11]:
df.values #numpy array객체 # columns의 이름을 key로 접근

array([[5, 0, 3, 3],
       [7, 9, 3, 5],
       [2, 4, 7, 6]])

In [13]:
df.loc[0,'col2':'col3'] # series 객체 반환

col2    0
col3    3
Name: 0, dtype: int32

In [14]:
df.loc[0:0,'col2':'col3'] # slicing 으로 접근하면 data frame 반환

   col2  col3
0     0     3

In [15]:
df.loc[[0],'col2':'col3'] # 벡터([0])로 접근해도 data frame 반환

   col2  col3
0     0     3

In [16]:
df.loc[0:2,'col2':'col3']

   col2  col3
0     0     3
1     9     3
2     4     7

In [17]:
df.loc[(df['col2']>2)&(df['col3']<5),'col2':'col3'] # 참이다 거짓이다 로 배열 만든 것 = 부울 배열

   col2  col3
1     9     3

In [18]:
df.iloc[0,1:3] #1,2 / series

col2    0
col3    3
Name: 0, dtype: int32

In [19]:
df.iloc[0:1,1:3] # 0, 1,2 /dataframe

   col2  col3
0     0     3

In [21]:
df.iloc[[0],1:3] # dataframe

   col2  col3
0     0     3

In [22]:
df.iloc[0:3,1:3] #0,1,2 1,2

   col2  col3
0     0     3
1     9     3
2     4     7

In [23]:
df

   col1  col2  col3  col4
0     5     0     3     3
1     7     9     3     5
2     2     4     7     6

In [24]:
df['total']=df.sum(axis=1) # 행 연산 / 열 추가 
df

   col1  col2  col3  col4  total
0     5     0     3     3     11
1     7     9     3     5     24
2     2     4     7     6     19

In [25]:
df = df.drop(columns=['col4','total'],axis=1) # 행과 열 제거 
df

   col1  col2  col3
0     5     0     3
1     7     9     3
2     2     4     7

In [26]:
df.drop(index=1,axis=0)

   col1  col2  col3
0     5     0     3
2     2     4     7

In [27]:
# np.nan(not a number) 널 값 연산

In [31]:
df=pd.DataFrame([[1,2,3],[4,5,6],[np.nan,8,9],[10,np.nan,12]])

In [32]:
df

      0    1   2
0   1.0  2.0   3
1   4.0  5.0   6
2   NaN  8.0   9
3  10.0  NaN  12

In [33]:
df.dropna(axis=0)

     0    1  2
0  1.0  2.0  3
1  4.0  5.0  6

In [35]:
df.dropna(axis=1)

    2
0   3
1   6
2   9
3  12

In [36]:
df.fillna(df.mean(axis=0))

      0    1   2
0   1.0  2.0   3
1   4.0  5.0   6
2   5.0  8.0   9
3  10.0  5.0  12

In [38]:
df1 = pd.DataFrame({'name':['이순신','강감찬','을지문덕','김유신'],
                   'dept':['연구개발','영업','연구개발','인사']})
df2 = pd.DataFrame({'emp_name':['강감찬','을지문덕','이순신','이순신'],
                   'project':['S','D','A','S']})

In [46]:
pd.merge(df1,df2,left_on='name',right_on='emp_name').drop('emp_name',axis=1)#emp_name 인 칼럼을 제거

   name  dept project
0   이순신  연구개발       A
1   이순신  연구개발       S
2   강감찬    영업       S
3  을지문덕  연구개발       D

In [41]:
pd.merge(df1,df2,how='outer',left_on='name',right_on='emp_name').drop('emp_name',axis=1)
# outer join 는 왼쪽 오른쪽 데이터 다 합집합 없는 데이터는 nan로 채움

   name  dept project
0   이순신  연구개발       A
1   이순신  연구개발       S
2   강감찬    영업       S
3  을지문덕  연구개발       D
4   김유신    인사     NaN

In [42]:
# 시각화 패키지(seaborn) 가 가지고 있는 데이터 셋 titanic

In [47]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [48]:
titanic.sort_values(by=['fare','sex'],ascending=[False,True]).head() 
# 운임은 내림차순, 성별은 오름차순

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False

In [50]:
titanic.groupby('sex')[['survived']].aggregate('mean')
# 그룹핑하려는 column 지정 / 성별에 따른 생존여부 (성별생존율 연산을 위해 aggregate함수 사용)

        survived
sex
female  0.742038
male    0.188908

In [51]:
titanic.groupby('sex')['survived'].aggregate('mean')
# series 형태로 나옴 (column 이 하나일 경우에는 기본적으로 시리즈 형태로 나옴)

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [54]:
titanic.groupby('sex')[['survived']].aggregate('mean').apply(lambda x: x - x.mean())
# aggregate로 계산 된 mean 값(아웃풋)의 평균을 중심이동 시킴. = 결과 표준화

        survived
sex
female  0.276565
male   -0.276565

In [58]:
titanic.groupby(['sex','class'])['survived'].aggregate('mean').unstack()
# 성별, 클래스별 (클래스들을) 기분으로 그룹핑.
# ['survived'] 로만 하면 시리즈로 출력되는데 (아래 셀 아웃풋 처럼)
# unstack 함수를 이용해 series를 dataframe 으로 반환

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [57]:
titanic.groupby(['sex','class'])['survived'].aggregate('mean')

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [59]:
titanic.pivot_table('survived',index='sex',columns='class')
# groupby를 이용하는 것보다 빠름... 이걸 추천

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447